a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
'''
print(a[4:7])
print(a[4:-1])
print(a[2:8:3])
print(a[2:9:3])
print(a[:7])
print(a[7:])
print(a[:])

print(a[:7:2])#시퀀객체[:끝인덱스번호:증가폭]
print(a[7::2])
print(a[::2])
print(a[::]) #print(a[:])와 같다. 
'''

#len으로 리스트 전체를 가져오기
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]

print(a[0:len(a)])
print(a[:len(a)])


b=(0,10,20,30,40,50,60,70,80,90)
print(b[4:7])
print(b[4:])
print(b[:7:2])

r=range(10)
print(r)
print(r[4:7])
print(r[4:])
print(r[:7:2])
print(list(r[:7:2]) )

r_list = list(r)
print(r_list)
print(r_list[4:7])


hello = 'Hello, World!'
print(hello[2:9])
print(hello[2:])
print(hello[:9:2])


#슬라이싱을 통해 값의 변경도 가능하다
a=[0,10,20,30,40,50,60,70,80,90]
print(a)
a[2:5] = ['a','b','c']
print(a)


a=[0,10,20,30,40,50,60,70,80,90]
a[2:5] = ['a'] #[주의] 2,3,4 셀에 모두 a를 넣는게 아님. 1개 셀에만 a넣고 나머지 2개는 삭제.
print(a)

a=[0,10,20,30,40,50,60,70,80,90]
a[2:5] = ['a','b','c','d','e'] #넘쳐도 모조리 할당들 함. 많은 대로 유동성있게 대응한 셈.
print(a)

a=[0,10,20,30,40,50,60,70,80,90]
a[2:8:2] = ['a','b','c']
print(a)

a=[0,10,20,30,40,50,60,70,80,90]
#a[2:8:2] = ['a','b'] #에러예제 #증가폭 사용시에는 갯수 정확히 맞춰줘야 함

#튜플,어렌지,문자열은 슬라스 요소범위 지정 통한 변경불가
b=(0,10,20,30,40,50,60,70,80,90)
#b[2:5] = ('a','b','c') #에러예제 

r= range(10)
#r[2:5] = range(0,3) #에러예제 


a=[0,10,20,30,40,50,60,70,80,90]
del a[2:5]
print(a)

a=[0,10,20,30,40,50,60,70,80,90]
del a[2:8:2]
print(a)


b=(0,10,20,30,40,50,60,70,80,90)
#del b[2:5]

r = range(0,10)
del r[2:5]

hello='Hello, World!'

del hello[2:9]









